EAC 573 S09 - Python coding in COLAB

Databases & Queries

DATA

from LIST to TUPLE to DICTIONARY

In [1]:
# Data: List & Tuple
myList = [1, 2, 3, 4]
print(myList[1])

myTuple = (5, 6, 7, 8)  # static / cannot change values
print(myTuple[1])

otherTuple = tuple(myList)    # tranform - from list to tuple
print(otherTuple[3])

2
6
4

In [2]:
# Data: Dictionary

myDict = {'Account': 'Cash', 'Code': 100, 'DxC': 'D'}
print(myDict)
print(myDict.keys())
print(myDict['Code'])
myDict.clear()

{'Account': 'Cash', 'Code': 100, 'DxC': 'D'}
dict_keys(['Account', 'Code', 'DxC'])
100

SciPy.org

PANDAS

In [3]:
# Data: PANDAS
# LPBProgram27.py
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
 "capital": ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
 "area": [8.516, 17.10, 3.286, 9.597, 1.221],
 "population": [200.4, 143.5, 1252, 1357, 52.98] }
import pandas as pd
brics = pd.DataFrame(dict)
list(brics)
print(brics)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [4]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [5]:
brics.area

0     8.516
1    17.100
2     3.286
3     9.597
4     1.221
Name: area, dtype: float64

In [6]:
brics.iloc[2]

country           India
capital       New Delhi
area              3.286
population         1252
Name: 2, dtype: object

# SQL

Structured Query Language

DDL - Data Definition Language

DML - Data Manipulation Language

DCL - Data Control Language

TCL - Transaction Control Language

DB Server

Oracle, MySQL, PostGres, DB2, MS SQL, Sybase ...

Firebase, SQLite...


Connection

Cursor

Database

Table

# SQLite3

In [8]:
# LPB Databases
# SQLLite3
##################### Connection (Colab Cloud)

import sqlite3

conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

conn.close()

In [9]:
# LPB Databases
# SQLLite3
##################### Check for tables in DB / Connection
import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
SELECT name FROM sqlite_master WHERE TYPE = "table";
'''
cursor = conn.execute(sql)

#print(list(cursor.fetchall()))

# OR

for row in cursor:
  print(row)

conn.close()

('T101',)

In [12]:
# LPB Databases
# SQLLite3
##################### CREATE TABLE

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
  CREATE TABLE T101 (
  CODE INT NOT NULL PRIMARY KEY,
  NAME CHAR(20),
  AGE INT,
  GENDER CHAR(1),
  INCOME FLOAT);
'''

conn.execute(sql)
conn.close

In [11]:
# LPB Databases
# SQLLite3
##################### DROP TABLE

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
  DROP TABLE T101 ;
'''

conn.execute(sql)
conn.close()

In [13]:
# LPB Databases
# SQLLite3
##################### CREATE TABLE
import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

# USE "IF NOT EXISTS" to avoid error
#  CREATE TABLE IF NOT EXISTS T101 (


sql = '''
  CREATE TABLE IF NOT EXISTS T101 (
  CODE INT NOT NULL PRIMARY KEY,
  NAME CHAR(20),
  AGE INT,
  GENDER CHAR(1),
  INCOME FLOAT);
'''

conn.execute(sql)


conn.close

In [14]:
# LPB Databases
# SQLLite3
##################### PRAGMA (DESC TABLE)
# cid, name, type, not null/1, default, PK

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
  PRAGMA table_info("T101");
'''

cursor = conn.execute(sql)

#print(list(cursor.fetchall()))

# OR

for row in cursor:
  print(row)


conn.close()

(0, 'CODE', 'INT', 1, None, 1)
(1, 'NAME', 'CHAR(20)', 0, None, 0)
(2, 'AGE', 'INT', 0, None, 0)
(3, 'GENDER', 'CHAR(1)', 0, None, 0)
(4, 'INCOME', 'FLOAT', 0, None, 0)

In [15]:
# LPB Databases
# SQLLite3
##################### INSERT

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
INSERT INTO T101 VALUES
(1, "Brian May", 55, "M", 100000);
'''
conn.execute(sql)

sql = '''
INSERT INTO T101 VALUES
(2, "Peter June", 66, "M", 200000);
'''
conn.execute(sql)

sql = '''
INSERT INTO T101 VALUES
(3, "Tina July", 77, "F", 300000);
'''
conn.execute(sql)


sql = '''
INSERT INTO T101 VALUES
(4, "Tricia August", 88, "F", 400000);
'''
conn.execute(sql)

conn.commit()
conn.close()

In [16]:
# LPB Databases
# SQLLite3
##################### SELECT

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file

sql = '''
  SELECT * FROM T101;
'''

cursor = conn.execute(sql)

#print(list(cursor.fetchall()))

# OR

for row in cursor:
  print(row)


conn.close()

(1, 'Brian May', 55, 'M', 100000.0)
(2, 'Peter June', 66, 'M', 200000.0)
(3, 'Tina July', 77, 'F', 300000.0)
(4, 'Tricia August', 88, 'F', 400000.0)

# SQL Statements to try out...
#a 
select * from T101 where income > 200000;
#b 
select * from T101 where gender ="M";
#c 
select name from T101;
#d 
select name from T101 order by income desc;
#e 
select avg(income) from T101;

In [23]:
# LPB Databases
# SQLLite3
##################### SELECT --try out-- [a]

import sqlite3
conn = sqlite3.connect('eac573a.db')   # create and connect to the db file


sql_a = '''
select * from T101 where income > 200000;
'''

sql_b = '''
select * from T101 where gender ="M";
'''

sql_c = '''
select name from T101;
'''

sql_d = '''
select name from T101 order by income desc;
'''

sql_e = '''
select avg(income) from T101;
'''


cursor = conn.execute(sql_a)  ## select the statement

for row in cursor:
  print(row)

conn.close()

(3, 'Tina July', 77, 'F', 300000.0)
(4, 'Tricia August', 88, 'F', 400000.0)

#Program-Exercise 31 (pe31.py)
# (revision of this class)

Create a program linked to SQLite3 to

(a) DROP (existing) TABLE T101, 

(b) CREATE (if it does not exist) T101,

(c) INSERT values, 

(d) SELECT DATA, and

(e) print all FETCHED data (as loop)